Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include "rtthread.h"
#include "rthw.h"
#include "oled.h"
#include "esp8266_init.h"
#include "dht11.h"
#include "platform_mqtt.h"
#include "esp8266_config.h"
#include "light_sensor.h"
#include "mq2.h"
#include "pir_sensor.h"
#include "onenet_kv.h"
#include "onenet_cmd.h"
#include "mqtt_worker.h"
#include "relay.h"
#include "buzzer.h"
#include "platform_mqtt_esp8266_impl.h"
#include "key.h"
#include "led.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DHT11_UPLOAD_ENABLED 1
#define DHT11_UPLOAD_INTERVAL 3600
#define DHT11_READ_RETRY 3

#define THRESHOLD_CONTROL_ENABLED 0
#define THRESHOLD_TEMP_MAX_DEFAULT 35
#define THRESHOLD_HUMI_MAX_DEFAULT 80
#define THRESHOLD_MQ2_MAX_DEFAULT 30
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
uint8_t t = ' ';

static rt_thread_t led_thread = RT_NULL;
static rt_thread_t oled_thread = RT_NULL;
static rt_thread_t dht11_thread = RT_NULL;
static rt_thread_t adc_sensor_thread = RT_NULL;
static rt_thread_t pir_sensor_thread = RT_NULL;
static rt_thread_t mqtt_thread = RT_NULL;
static rt_thread_t key_thread = RT_NULL;

static rt_mutex_t g_esp8266_mutex = RT_NULL;
static rt_sem_t g_mqtt_frame_sem = RT_NULL;

static uint8_t g_mqtt_configured = 0;
static uint8_t g_mqtt_connected = 0;

static dht11_data_t g_dht11_data;
static uint8_t g_dht11_valid = 0;

onenet_kv_table_t g_kv_table;
onenet_cmd_ctx_t g_cmd_ctx;
mqtt_worker_t g_mqtt_worker;

static int g_kv_temperature = 0;
static int g_kv_humidity = 0;
static int g_kv_light = 0;
static int g_kv_mq2 = 0;
static uint8_t g_kv_bsp_led = 1;
static uint8_t g_kv_fan = 0;
static uint8_t g_kv_nebulizer = 0;
static uint8_t g_kv_buzzer = 0;
static char g_kv_pir[ONENET_KV_MAX_STRING_LEN] = "not_detected";

static int g_kv_temp_max = THRESHOLD_TEMP_MAX_DEFAULT;
static int g_kv_humi_max = THRESHOLD_HUMI_MAX_DEFAULT;
static int g_kv_mq2_max = THRESHOLD_MQ2_MAX_DEFAULT;

static void mqtt_post_keys(const char *key1, const char *key2)
{
  if (!g_mqtt_connected)
    return;

  mqtt_post_item_t item;
  memset(&item, 0, sizeof(item));
  strncpy(item.keys[0], key1, ONENET_KV_MAX_KEY_LEN - 1);
  item.key_count = 1;
  if (key2 != RT_NULL)
  {
    strncpy(item.keys[1], key2, ONENET_KV_MAX_KEY_LEN - 1);
    item.key_count = 2;
  }
  mqtt_worker_submit(&g_mqtt_worker, &item);
}
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
static void dwt_init(void);
static int mqtt_init(void);
static void onenet_kv_table_setup(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static int8_t bsp_led_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t led_val = *((uint8_t *)value);
  if (led_val)
    led_on();
  else
    led_off();
  rt_kprintf("BSP_LED changed -> %d (%s)\n", led_val, led_val ? "on" : "off");
  return 0;
}

static int8_t fan_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t fan_val = *((uint8_t *)value);
  relay_fan_set(fan_val);
  rt_kprintf("FAN changed -> %d (%s)\n", fan_val, fan_val ? "ON" : "OFF");
  return 0;
}

static int8_t nebulizer_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t nebulizer_val = *((uint8_t *)value);
  relay_nebulizer_set(nebulizer_val);
  rt_kprintf("NEBULIZER changed -> %d (%s)\n", nebulizer_val, nebulizer_val ? "ON" : "OFF");
  return 0;
}

static int8_t buzzer_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t buzzer_val = *((uint8_t *)value);
  buzzer_set(buzzer_val);
  rt_kprintf("BUZZER changed -> %d (%s)\n", buzzer_val, buzzer_val ? "ON" : "OFF");
  return 0;
}

void key_event_callback(uint8_t key_id, uint8_t event, void *user_data)
{
  (void)user_data;
  const char *key_names[KEY_COUNT] = {"KEY1", "KEY2", "KEY3", "KEY4"};
  const char *event_name = "UNKNOWN";

  switch (event)
  {
  case KEY_EVENT_NONE:
    event_name = "NONE";
    break;
  case KEY_EVENT_PRESS:
    event_name = "PRESS";
    break;
  case KEY_EVENT_RELEASE:
    event_name = "RELEASE";
    break;
  case KEY_EVENT_LONG_PRESS:
    event_name = "LONG_PRESS";
    break;
  case KEY_EVENT_CLICK:
    event_name = "CLICK";
    break;
  case KEY_EVENT_DOUBLE_CLICK:
    event_name = "DOUBLE_CLICK";
    break;
  default:
    event_name = "UNKNOWN";
    break;
  }

  rt_kprintf("[KEY] %s event: %s\n", key_names[key_id], event_name);

  if (event == KEY_EVENT_CLICK)
  {
    switch (key_id)
    {
    case 0:
      g_kv_fan = !g_kv_fan;
      relay_fan_set(g_kv_fan);
      rt_kprintf("  FAN toggled -> %d\n", g_kv_fan);
      mqtt_post_keys("FAN", RT_NULL);
      break;
    case 1:
      g_kv_nebulizer = !g_kv_nebulizer;
      relay_nebulizer_set(g_kv_nebulizer);
      rt_kprintf("  NEBULIZER toggled -> %d\n", g_kv_nebulizer);
      mqtt_post_keys("NEBULIZER", RT_NULL);
      break;
    case 2:
      g_kv_buzzer = !g_kv_buzzer;
      buzzer_set(g_kv_buzzer);
      rt_kprintf("  BUZZER toggled -> %d\n", g_kv_buzzer);
      mqtt_post_keys("BUZZER", RT_NULL);
      break;
    case 3:
      g_kv_bsp_led = !g_kv_bsp_led;
      if (g_kv_bsp_led)
        led_on();
      else
        led_off();
      rt_kprintf("  LED toggled -> %d\n", g_kv_bsp_led);
      mqtt_post_keys("BSP_LED", RT_NULL);
      break;
    }
  }
  else if (event == KEY_EVENT_LONG_PRESS)
  {
    rt_kprintf("  %s long pressed - special action\n", key_names[key_id]);
  }
}

