Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
static void onenet_kv_table_setup(void)
{
  onenet_kv_init(&g_kv_table);

  onenet_kv_register(&g_kv_table, "TEMPERATURE",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_temperature, NULL);
  onenet_kv_register(&g_kv_table, "HUMIDITY",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_humidity, NULL);
  onenet_kv_register(&g_kv_table, "LIGHT",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_light, NULL);
  onenet_kv_register(&g_kv_table, "MQ2",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_mq2, NULL);
  onenet_kv_register(&g_kv_table, "BSP_LED",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_bsp_led, bsp_led_on_change);
  onenet_kv_register(&g_kv_table, "FAN",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_fan, fan_on_change);
  onenet_kv_register(&g_kv_table, "NEBULIZER",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_nebulizer, nebulizer_on_change);
  onenet_kv_register(&g_kv_table, "BUZZER",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_buzzer, buzzer_on_change);
  onenet_kv_register(&g_kv_table, "PIR",
                     PLATFORM_MQTT_VALUE_STRING, g_kv_pir, NULL);
#if THRESHOLD_CONTROL_ENABLED
  onenet_kv_register(&g_kv_table, "TEMP_MAX",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_temp_max, NULL);
  onenet_kv_register(&g_kv_table, "HUMI_MAX",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_humi_max, NULL);
  onenet_kv_register(&g_kv_table, "MQ2_MAX",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_mq2_max, NULL);
#endif

  mqtt_worker_init(&g_mqtt_worker, &g_kv_table,
                   &g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                   ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                   g_esp8266_mutex);

  onenet_cmd_init(&g_cmd_ctx, &g_kv_table);
}

static void oled_thread_entry(void *parameter)
{
  while (1)
  {
    // OLED_ShowPicture(0, 0, 128, 64, BMP1, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowChinese(0, 0, 0, 16, 1);
    OLED_ShowChinese(18, 0, 1, 16, 1);
    OLED_ShowChinese(36, 0, 2, 16, 1);
    OLED_ShowChinese(54, 0, 3, 16, 1);
    OLED_ShowChinese(72, 0, 4, 16, 1);
    OLED_ShowChinese(90, 0, 5, 16, 1);
    OLED_ShowChinese(108, 0, 6, 16, 1);
    OLED_ShowString(8, 16, (uint8_t *)"ZHONGJINGYUAN", 16, 1);
    OLED_ShowString(20, 32, (uint8_t *)"2014/05/01", 16, 1);
    OLED_ShowString(0, 48, (uint8_t *)"ASCII:", 16, 1);
    OLED_ShowString(63, 48, (uint8_t *)"CODE:", 16, 1);
    OLED_ShowChar(48, 48, t, 16, 1);
    t++;
    if (t > '~')
      t = ' ';
    OLED_ShowNum(103, 48, t, 3, 16, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowChinese(0, 0, 0, 16, 1);
    OLED_ShowChinese(16, 0, 0, 24, 1);
    OLED_ShowChinese(24, 20, 0, 32, 1);
    OLED_ShowChinese(64, 0, 0, 64, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowString(0, 0, (uint8_t *)"ABC", 8, 1);
    OLED_ShowString(0, 8, (uint8_t *)"ABC", 12, 1);
    OLED_ShowString(0, 20, (uint8_t *)"ABC", 16, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);
    // OLED_ScrollDisplay(11, 4, 1);
  }
}

static void dht11_thread_entry(void *parameter)
{
  rt_thread_mdelay(3000);
  while (1)
  {
    dht11_data_t dht11_data;
    int dht11_ok = 0;
    int retry;

    for (retry = 0; retry < DHT11_READ_RETRY; retry++)
    {
      if (dht11_read(&dht11_data) == DHT11_OK)
      {
        dht11_ok = 1;
        break;
      }
      rt_kprintf("  DHT11 read retry %d/%d\n", retry + 1, DHT11_READ_RETRY);
      rt_thread_mdelay(200);
    }

    if (dht11_ok)
    {
      g_kv_temperature = dht11_data.temperature_int;
      g_kv_humidity = dht11_data.humidity_int;
      rt_kprintf("  DHT11: Temp=%dC, Humi=%d%%\n",
                 g_kv_temperature, g_kv_humidity);

#if THRESHOLD_CONTROL_ENABLED
      if (g_kv_temperature >= g_kv_temp_max && !g_kv_fan)
      {
        g_kv_fan = 1;
        relay_fan_set(1);
        rt_kprintf("  [ALERT] Temp=%d >= MAX=%d, FAN ON\n", g_kv_temperature, g_kv_temp_max);
        mqtt_post_keys("FAN", RT_NULL);
      }
      else if (g_kv_temperature < g_kv_temp_max && g_kv_fan)
      {
        g_kv_fan = 0;
        relay_fan_set(0);
        rt_kprintf("  [ALERT] Temp=%d < MAX=%d, FAN OFF\n", g_kv_temperature, g_kv_temp_max);
        mqtt_post_keys("FAN", RT_NULL);
      }

      if (g_kv_humidity >= g_kv_humi_max && !g_kv_nebulizer)
      {
        g_kv_nebulizer = 1;
        relay_nebulizer_set(1);
        rt_kprintf("  [ALERT] Humi=%d >= MAX=%d, NEBULIZER ON\n", g_kv_humidity, g_kv_humi_max);
        mqtt_post_keys("NEBULIZER", RT_NULL);
      }
      else if (g_kv_humidity < g_kv_humi_max && g_kv_nebulizer)
      {
        g_kv_nebulizer = 0;
        relay_nebulizer_set(0);
        rt_kprintf("  [ALERT] Humi=%d < MAX=%d, NEBULIZER OFF\n", g_kv_humidity, g_kv_humi_max);
        mqtt_post_keys("NEBULIZER", RT_NULL);
      }
#endif

      mqtt_post_keys("TEMPERATURE", "HUMIDITY");
    }
    else
    {
      rt_kprintf("  DHT11 read failed after %d retries\n", DHT11_READ_RETRY);
    }

    rt_thread_mdelay(DHT11_UPLOAD_INTERVAL);
  }
}

static void adc_sensor_thread_entry(void *parameter)
{
  uint16_t light_raw, mq2_raw;
  uint8_t light_percentage, mq2_percentage;

  rt_thread_mdelay(1000);
  light_sensor_init();
  mq2_init();

  while (1)
  {
    light_raw = light_sensor_read_raw();
    light_percentage = light_sensor_read_percentage();

    mq2_raw = mq2_read_raw();
    mq2_percentage = mq2_read_percentage();

    rt_kprintf("Light: Raw=%d, Pct=%d%% | MQ2: Raw=%d, Pct=%d%%\n",
               light_raw, light_percentage, mq2_raw, mq2_percentage);

    g_kv_light = light_percentage;
    g_kv_mq2 = mq2_percentage;

#if THRESHOLD_CONTROL_ENABLED
    if (g_kv_mq2 >= g_kv_mq2_max && !g_kv_buzzer)
    {
      g_kv_buzzer = 1;
      buzzer_set(1);
      rt_kprintf("  [ALERT] MQ2=%d >= MAX=%d, BUZZER ON\n", g_kv_mq2, g_kv_mq2_max);
      mqtt_post_keys("BUZZER", RT_NULL);
    }
    else if (g_kv_mq2 < g_kv_mq2_max && g_kv_buzzer)
    {
      g_kv_buzzer = 0;
      buzzer_set(0);
      rt_kprintf("  [ALERT] MQ2=%d < MAX=%d, BUZZER OFF\n", g_kv_mq2, g_kv_mq2_max);
      mqtt_post_keys("BUZZER", RT_NULL);
    }
#endif

    mqtt_post_keys("LIGHT", "MQ2");

    rt_thread_mdelay(5000);
  }
}

static void pir_sensor_thread_entry(void *parameter)
{
  uint8_t pir_status;

  rt_thread_mdelay(1500);
  pir_sensor_init();

  while (1)
  {
    pir_status = pir_sensor_read();

    if (pir_status == PIR_DETECTED)
    {
      rt_kprintf("PIR Sensor: Detected! (Someone is here)\n");
      strncpy(g_kv_pir, "detected", sizeof(g_kv_pir) - 1);
    }
    else
    {
      rt_kprintf("PIR Sensor: Not detected (No one)\n");
      strncpy(g_kv_pir, "not_detected", sizeof(g_kv_pir) - 1);
    }

    if (g_mqtt_connected)
    {
      mqtt_post_item_t item;
      memset(&item, 0, sizeof(item));
      strncpy(item.keys[0], "PIR", ONENET_KV_MAX_KEY_LEN - 1);
      item.key_count = 1;
      mqtt_worker_submit(&g_mqtt_worker, &item);
    }

