Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
    rt_thread_mdelay(3000);
  }
}

static void mqtt_frame_isr_cb(void *arg)
{
  (void)arg;
  rt_sem_release(g_mqtt_frame_sem);
}

static void mqtt_process_recv(void)
{
  static char recv_topic[PLATFORM_MQTT_MAX_TOPIC_LEN];
  static char recv_payload[PLATFORM_MQTT_MAX_PAYLOAD_LEN];
  static char recv_msg_id[32];
  static uint8_t raw_buf[ESP8266_UART_RX_BUF_SIZE];

  while (1)
  {
    uint16_t raw_len = 0;
    uint8_t has_raw = 0;

    rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);

    if (g_esp8266_mqtt.wifi->urc.ready)
    {
      raw_len = wifi_esp8266_urc_copy(g_esp8266_mqtt.wifi, raw_buf, sizeof(raw_buf));
      rt_mutex_release(g_esp8266_mutex);
      if (raw_len > 0)
        has_raw = 1;
    }
    else if (g_esp8266_mqtt.wifi->rx_frame.sta.finsh == 1)
    {
      rt_base_t level = rt_hw_interrupt_disable();
      uint16_t flen = g_esp8266_mqtt.wifi->rx_frame.sta.len;
      if (flen > sizeof(raw_buf) - 1)
        flen = sizeof(raw_buf) - 1;
      memcpy(raw_buf, g_esp8266_mqtt.wifi->rx_frame.buf, flen);
      g_esp8266_mqtt.wifi->rx_frame.sta.len = 0;
      g_esp8266_mqtt.wifi->rx_frame.sta.finsh = 0;
      rt_hw_interrupt_enable(level);
      raw_buf[flen] = '\0';
      raw_len = flen;
      rt_mutex_release(g_esp8266_mutex);
      has_raw = 1;
    }
    else
    {
      rt_mutex_release(g_esp8266_mutex);
      return;
    }

    if (!has_raw)
      return;

    if (strstr((const char *)raw_buf, "+MQTTSUBRECV:") == NULL)
      continue;

    memset(recv_topic, 0, sizeof(recv_topic));
    memset(recv_payload, 0, sizeof(recv_payload));
    memset(recv_msg_id, 0, sizeof(recv_msg_id));

    int16_t recv_ret = esp8266_mqtt_parse_set_from_buf(
        (const char *)raw_buf, raw_len,
        recv_topic, recv_payload,
        sizeof(recv_payload), recv_msg_id);

    if (recv_ret != PLATFORM_MQTT_OK)
      continue;

    if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_SET) == 0)
    {
      rt_kprintf("[mqtt] SET: %s\n", recv_payload);

      int reply_code;
      const char *reply_msg;
      onenet_cmd_handle_set(&g_cmd_ctx, recv_payload, &reply_code, &reply_msg);

      rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
      int16_t reply_ret = MQTT_PUBLISH_SET_REPLY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                                 ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                                 recv_msg_id, reply_code, reply_msg);
      rt_mutex_release(g_esp8266_mutex);

      if (reply_ret == PLATFORM_MQTT_OK)
        rt_kprintf("[mqtt] SET_REPLY sent (code=%d)\n", reply_code);
      else
        rt_kprintf("[mqtt] SET_REPLY FAIL (err=%d)\n", reply_ret);
    }
    else
    {
      if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_POST_REPLY) == 0)
        continue;

      rt_kprintf("[mqtt] topic=%s\n", recv_topic);
      rt_kprintf("[mqtt] payload=%s\n", recv_payload);

      if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_GET) == 0)
      {
        onenet_cmd_handle_get(&g_cmd_ctx, recv_payload, recv_msg_id);
      }
      else if (strcmp(recv_topic, ONENET_TOPIC_OTA_INFORM) == 0)
      {
        rt_kprintf("[mqtt] OTA inform\n");
      }
    }
  }
}

static void mqtt_thread_entry(void *parameter)
{
  rt_thread_mdelay(2000);
  wifi_esp8266_set_frame_cb(g_esp8266_mqtt.wifi, mqtt_frame_isr_cb, NULL);
  rt_kprintf("[mqtt] Unified thread started\n");

  while (1)
  {
    mqtt_process_recv();

    rt_err_t sem_ret = rt_sem_take(g_mqtt_frame_sem, 2000);

    if (sem_ret == -RT_ETIMEOUT)
    {
      if (!g_mqtt_connected)
      {
        rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
        if (mqtt_init() == 0)
          rt_kprintf("[mqtt] Reconnected!\n");
        rt_mutex_release(g_esp8266_mutex);
      }
    }
    else if (g_mqtt_connected)
    {
      mqtt_process_recv();
    }

    while (mqtt_worker_process_one(&g_mqtt_worker))
    {
      mqtt_process_recv();
    }
  }
}

static int mqtt_do_connect(void)
{
  int16_t ret;

  if (!g_mqtt_configured)
  {
    platform_mqtt_user_config_t config;

    memset(&config, 0, sizeof(config));
    strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
    strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);
    strncpy(config.password, ONENET_MQTT_TOKEN, sizeof(config.password) - 1);

    ret = MQTT_USERCFG(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID, &config);
    if (ret != PLATFORM_MQTT_OK)
    {
      rt_kprintf("MQTT config FAILED! (error=%d)\n", ret);
      return -1;
    }
    g_mqtt_configured = 1;
    rt_kprintf("MQTT configured!\n");
  }
  else
  {
    rt_kprintf("MQTT already configured, reconnecting...\n");
  }

  ret = MQTT_CONNECT(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                     ONENET_MQTT_HOST, ONENET_MQTT_PORT, 1);
  if (ret != PLATFORM_MQTT_OK)
  {
    rt_kprintf("MQTT connect FAILED! resetting config flag\n");
    g_mqtt_configured = 0;
    g_mqtt_connected = 0;
    return -1;
  }

  g_mqtt_connected = 1;
  rt_kprintf("MQTT connected!\n");
  return 0;
}

static void mqtt_do_subscribe(void)
{
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_POST_REPLY, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_SET, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_GET, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_OTA_INFORM, 1);
  rt_kprintf("MQTT subscribed!\n");
}

static int mqtt_init(void)
{
  int16_t ret;
  char ip_buf[64];
  uint8_t wifi_mode;

  rt_kprintf("Restarting ESP8266...\n");
  ret = WIFI_SW_RESET(&g_esp8266_wifi.base);
  if (ret != PLATFORM_WIFI_OK)
  {
    rt_kprintf("ESP8266 restart FAILED! (error=%d)\n", ret);
  }
  else
  {
    rt_kprintf("ESP8266 restarted successfully!\n");
  }
  rt_thread_mdelay(200);

  rt_kprintf("Checking MQTT connection...\n");

  if (MQTT_CHECK_CONNECTED(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID) == PLATFORM_MQTT_OK)
  {
    rt_kprintf("MQTT already connected!\n");
    g_mqtt_connected = 1;
    return 0;
  }

  rt_kprintf("MQTT not connected, checking WiFi...\n");

  if (WIFI_AT_TEST(&g_esp8266_wifi.base) != PLATFORM_WIFI_OK)
  {
    rt_kprintf("ESP8266 AT test FAILED!\n");
    return -1;
  }

  ret = WIFI_GET_MODE(&g_esp8266_wifi.base, &wifi_mode);
  if (ret == PLATFORM_WIFI_OK)
  {
    rt_kprintf("WiFi mode: %d (1=STA, 2=AP, 3=STA+AP)\n", wifi_mode);
    if (wifi_mode != PLATFORM_WIFI_MODE_STA)
    {
      rt_kprintf("Setting WiFi to Station mode...\n");
      ret = WIFI_SET_MODE(&g_esp8266_wifi.base, PLATFORM_WIFI_MODE_STA);
      if (ret != PLATFORM_WIFI_OK)
      {
        rt_kprintf("Set Station mode FAILED! (error=%d)\n", ret);
        return -1;
      }
      rt_thread_mdelay(100);
    }
  }

  if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) != PLATFORM_WIFI_OK)
  {
    rt_kprintf("WiFi not connected, connecting...\n");
    ret = WIFI_JOIN_AP(&g_esp8266_wifi.base, ESP8266_WIFI_SSID, ESP8266_WIFI_PASSWORD);
    if (ret != PLATFORM_WIFI_OK)
    {
      rt_kprintf("WiFi connect FAILED! (error=%d)\n", ret);
      return -1;
    }
    rt_kprintf("WiFi connected!\n");
    rt_thread_mdelay(200);
  }
  else
  {
    rt_kprintf("WiFi already connected (IP: %s)\n", ip_buf);
  }

  rt_kprintf("Connecting MQTT...\n");
  if (mqtt_do_connect() != 0)
  {
    return -1;
  }

  mqtt_do_subscribe();
  return 0;
}

